In [ ]:
import pandas as pd
import numpy as np

#### 1 : Create a Series of even numbers from 2 to 20.

In [3]:
a=pd.Series(np.arange(2,21,2))
a

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

#### 2 : Drop all rows with missing values.

In [4]:
a=pd.Series([1,2,3,np.nan,4],dtype="Int64") ### error because of int=Int
a

0       1
1       2
2       3
3    <NA>
4       4
dtype: Int64

In [5]:
a.isnull()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [6]:
a.dropna()

0    1
1    2
2    3
4    4
dtype: Int64

In [7]:
a1 = pd.Series([1, 2, 3, np.nan, 4], dtype="Int64")
print(a1)

0       1
1       2
2       3
3    <NA>
4       4
dtype: Int64

In [8]:
a=pd.Series([1,2,3,np.nan,4],dtype="Int32")
a

0       1
1       2
2       3
3    <NA>
4       4
dtype: Int32

In [9]:
#### 3 :
a.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
a1.dtype

Int64Dtype()

In [11]:
import pandas as pd

data = {
    "Name": ["Luffy", "Zoro", "Nami", "Sanji", "Robin", "Franky"],
    "Department": ["IT", "IT", "HR", "HR", "Finance", "Finance"],
    "Salary": [60000, 65000, 50000, 52000, 70000, 72000]
}

df = pd.DataFrame(data)
df

     Name Department  Salary
0   Luffy         IT   60000
1    Zoro         IT   65000
2    Nami         HR   50000
3   Sanji         HR   52000
4   Robin    Finance   70000
5  Franky    Finance   72000

In [12]:
df.rename(columns={"Name":"n"})  ####  raname the column names

        n Department  Salary
0   Luffy         IT   60000
1    Zoro         IT   65000
2    Nami         HR   50000
3   Sanji         HR   52000
4   Robin    Finance   70000
5  Franky    Finance   72000

In [13]:
df = df.rename(index={0: "first"}) #### raname the rows name
print(df)

         Name Department  Salary
first   Luffy         IT   60000
1        Zoro         IT   65000
2        Nami         HR   50000
3       Sanji         HR   52000
4       Robin    Finance   70000
5      Franky    Finance   72000

In [14]:
df.columns=["A","s","a"]  ### rename the all columns name at ones

In [15]:
df

            A        s      a
first   Luffy       IT  60000
1        Zoro       IT  65000
2        Nami       HR  50000
3       Sanji       HR  52000
4       Robin  Finance  70000
5      Franky  Finance  72000

In [16]:
df.index=[1,2,3,4,5,6] ### indexi all rows at ones

In [17]:
df

        A        s      a
1   Luffy       IT  60000
2    Zoro       IT  65000
3    Nami       HR  50000
4   Sanji       HR  52000
5   Robin  Finance  70000
6  Franky  Finance  72000

In [18]:
a.fillna(0)

0    1
1    2
2    3
3    0
4    4
dtype: Int32

In [19]:
df["c"]=df["a"]*.99

In [20]:
df

        A        s      a        c
1   Luffy       IT  60000  59400.0
2    Zoro       IT  65000  64350.0
3    Nami       HR  50000  49500.0
4   Sanji       HR  52000  51480.0
5   Robin  Finance  70000  69300.0
6  Franky  Finance  72000  71280.0

### Day 2: Indexing & Selection

In [21]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Ali", "Sara", "John"],
    "Age": [25, 30, 28],
    "City": ["Kochi", "Delhi", "Mumbai"]
})

# Select row with index 1 (by label)
df.loc[1]

# Select row range

Name     Sara
Age        30
City    Delhi
Name: 1, dtype: object

In [22]:
df

   Name  Age    City
0   Ali   25   Kochi
1  Sara   30   Delhi
2  John   28  Mumbai

In [23]:
print(df.loc[0:4, ["Name", "City"]])

   Name    City
0   Ali   Kochi
1  Sara   Delhi
2  John  Mumbai

In [24]:
df.loc[0,["Name"]]

Name    Ali
Name: 0, dtype: object

In [25]:
print(df.iat[1, 2])   # 30

Delhi

In [26]:
df = pd.DataFrame({
    "Name": ["Ali", "Sara", "John"],
    "Age": [25, 30, 28],
    "City": ["Kochi", "Delhi", "Mumbai"]
})

In [27]:
df.index=["a","b","c"]

In [28]:
df

   Name  Age    City
a   Ali   25   Kochi
b  Sara   30   Delhi
c  John   28  Mumbai

In [29]:
df.loc["a",["Name"]]="ali"

In [30]:
df

   Name  Age    City
a   ali   25   Kochi
b  Sara   30   Delhi
c  John   28  Mumbai

In [31]:
##########  Indexing and selection

In [32]:
import pandas as pd

# Sample DataFrame
students = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [24, 27, 22, 29, 26],
    "Salary": [50000, 60000, 55000, 70000, 65000],
    "Department": ["HR", "IT", "Finance", "IT", "HR"]
})

students

      Name  Age  Salary Department
0    Alice   24   50000         HR
1      Bob   27   60000         IT
2  Charlie   22   55000    Finance
3    David   29   70000         IT
4      Eva   26   65000         HR

In [33]:
### From a students DataFrame, select only the Name column.

In [34]:
students["Name"]

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [35]:
students.loc[:,"Name":"Age"]

      Name  Age
0    Alice   24
1      Bob   27
2  Charlie   22
3    David   29
4      Eva   26

In [36]:
### Select the first 3 rows using iloc.

In [37]:
students[:3]

      Name  Age  Salary Department
0    Alice   24   50000         HR
1      Bob   27   60000         IT
2  Charlie   22   55000    Finance

In [38]:
#### Select rows 2â€“4 and columns Name + Age using iloc.

In [39]:
students.iloc[2:4,[1,2]]

   Age  Salary
2   22   55000
3   29   70000

In [40]:
## Select the salary of the second employee using .at[].

In [41]:
students.at[1,"Salary"]

np.int64(60000)

In [42]:
students.iat[1,2]

np.int64(60000)

In [43]:
students.iloc[1:2,2:3]

   Salary
1   60000

In [44]:
(students[students["Age"]>25])["Name"]

1      Bob
3    David
4      Eva
Name: Name, dtype: object

In [45]:
(students.query("Salary>60000"))["Name"]

3    David
4      Eva
Name: Name, dtype: object

In [46]:
###

In [47]:
df = pd.DataFrame({"A":[1, np.nan, 3], "B":[4, 5, np.nan]})
print(df.isnull())

       A      B
0  False  False
1   True  False
2  False   True

In [48]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [49]:
df

     A    B
0  1.0  4.0
1  NaN  5.0
2  3.0  NaN

In [50]:
df.replace(np.nan, 5)

     A    B
0  1.0  4.0
1  5.0  5.0
2  3.0  5.0

In [51]:
import pandas as pd
import numpy as np

df = pd.DataFrame({"A":[1, np.nan, 3], "B":[4, 5, np.nan]})
df

     A    B
0  1.0  4.0
1  NaN  5.0
2  3.0  NaN

In [52]:
df.replace(1, 0)

     A    B
0  0.0  4.0
1  NaN  5.0
2  3.0  NaN

In [53]:
df2 = pd.DataFrame({"A":[1,1,2,2], "B":[4,4,5,5]})
print(df2.duplicated())
df2

0    False
1     True
2    False
3     True
dtype: bool

   A  B
0  1  4
1  1  4
2  2  5
3  2  5

In [54]:
df2.drop_duplicates(ignore_index=False)

   A  B
0  1  4
2  2  5

In [55]:
df = pd.DataFrame({"A":[1, np.nan, 3], "B":[4, 5, np.nan]})
print(df.isnull())

       A      B
0  False  False
1   True  False
2  False   True

In [56]:
a1=df.interpolate()
a1

     A    B
0  1.0  4.0
1  2.0  5.0
2  3.0  5.0

In [57]:
df

     A    B
0  1.0  4.0
1  NaN  5.0
2  3.0  NaN

In [58]:
data = {
    "ID": [101, 102, 103],                       # Integer
    "Name": ["Alice", "Bob", "Charlie"],         # String
    "Salary": [50000.0, 60000.5, 55000.75],     # Float
    "FullTime": [True, False, True],            # Boolean
    "JoiningDate": pd.to_datetime(["2020-01-15", "2021-06-10", "2019-09-23"])  # Date
}

df = pd.DataFrame(data)

In [59]:
df

    ID     Name    Salary  FullTime JoiningDate
0  101    Alice  50000.00      True  2020-01-15
1  102      Bob  60000.50     False  2021-06-10
2  103  Charlie  55000.75      True  2019-09-23

In [60]:
df.sum(numeric_only=True)

ID             306.00
Salary      165001.25
FullTime         2.00
dtype: float64

In [61]:
df["Salary"].sum()

np.float64(165001.25)

In [62]:
df["Salary"]

0    50000.00
1    60000.50
2    55000.75
Name: Salary, dtype: float64

In [63]:
##Sort the DataFrame by Age in descending order.

In [64]:
df["Salary"].sort_values(ascending=False)

1    60000.50
2    55000.75
0    50000.00
Name: Salary, dtype: float64

In [65]:
df.describe()

          ID        Salary          JoiningDate
count    3.0      3.000000                    3
mean   102.0  55000.416667  2020-05-26 16:00:00
min    101.0  50000.000000  2019-09-23 00:00:00
25%    101.5  52500.375000  2019-11-19 00:00:00
50%    102.0  55000.750000  2020-01-15 00:00:00
75%    102.5  57500.625000  2020-09-27 00:00:00
max    103.0  60000.500000  2021-06-10 00:00:00
std      1.0   5000.250008                  NaN

In [66]:
df

    ID     Name    Salary  FullTime JoiningDate
0  101    Alice  50000.00      True  2020-01-15
1  102      Bob  60000.50     False  2021-06-10
2  103  Charlie  55000.75      True  2019-09-23

In [67]:
a1

     A    B
0  1.0  4.0
1  2.0  5.0
2  3.0  5.0

In [68]:
a1.count()

A    3
B    3
dtype: int64

In [69]:
df.count()

ID             3
Name           3
Salary         3
FullTime       3
JoiningDate    3
dtype: int64

In [70]:
df.value_counts()

ID   Name     Salary    FullTime  JoiningDate
101  Alice    50000.00  True      2020-01-15     1
102  Bob      60000.50  False     2021-06-10     1
103  Charlie  55000.75  True      2019-09-23     1
Name: count, dtype: int64

In [71]:
df

    ID     Name    Salary  FullTime JoiningDate
0  101    Alice  50000.00      True  2020-01-15
1  102      Bob  60000.50     False  2021-06-10
2  103  Charlie  55000.75      True  2019-09-23

In [72]:
a1.value_counts()

A    B
1.0  4.0    1
2.0  5.0    1
3.0  5.0    1
Name: count, dtype: int64

In [73]:
a1

     A    B
0  1.0  4.0
1  2.0  5.0
2  3.0  5.0

In [74]:
nums = pd.Series([1, 2, 3, 4, 5])
b=pd.DataFrame(nums)
a=nums.apply(lambda y: y*2)
b["ab"]=a
b

   0  ab
0  1   2
1  2   4
2  3   6
3  4   8
4  5  10

In [75]:
b=pd.DataFrame(nums)
b

   0
0  1
1  2
2  3
3  4
4  5

#### Functions: pd.concat(), pd.merge(), .groupby(), .pivot_table(), .join(), .filter()

In [76]:
data = pd.DataFrame({
    "Dept":["HR","HR","IT","IT","Sales"],
    "Salary":[50000, 60000, 70000, 65000, 55000]
})

print(data.groupby("Dept")["Salary"].mean())   # Average salary per dept
print(data.groupby("Dept")["Salary"].sum())    # Total salary per dept

Dept
HR       55000.0
IT       67500.0
Sales    55000.0
Name: Salary, dtype: float64
Dept
HR       110000
IT       135000
Sales     55000
Name: Salary, dtype: int64

In [80]:
sales = pd.DataFrame({
    "Dept":["HR","HR","IT","IT","Sales"],
    "Month":["Jan","Feb","Jan","Feb","Jan"],
    "Revenue":[2000,3000,4000,3500,2500]
})

print(pd.pivot_table(sales, values="Revenue", index="Dept", columns="Month", aggfunc="sum"))

Month     Feb     Jan
Dept
HR     3000.0  2000.0
IT     3500.0  4000.0
Sales     NaN  2500.0

In [78]:
sales

    Dept Month  Revenue
0     HR   Jan     2000
1     HR   Feb     3000
2     IT   Jan     4000
3     IT   Feb     3500
4  Sales   Jan     2500

In [91]:
df1 = pd.DataFrame({"Name":["A","B"]}, index=[3,2])
df2 = pd.DataFrame({"Age":[23,25]}, index=[1,2])

print(df2.join(df1))

   Age Name
1   23  NaN
2   25    B

In [85]:
df1

  Name
3    A
2    B

In [86]:
df2

   Age
1   23
2   25

In [90]:
pd.concat([df2,df1],axis=1)

    Age Name
1  23.0  NaN
2  25.0    B
3   NaN    A

In [92]:
df = pd.DataFrame({
    "Name":["A","B","C"],
    "Salary":[50000,60000,70000],
    "Age":[23,25,30]
})

print(df.filter(items=["Name","Salary"]))     # Specific columns

  Name  Salary
0    A   50000
1    B   60000
2    C   70000

In [93]:
df

  Name  Salary  Age
0    A   50000   23
1    B   60000   25
2    C   70000   30

In [105]:
print(df.filter(like="N"))

  Name
0    A
1    B
2    C

In [102]:
print(df.filter(regex="A", axis=1))

   Age
0   23
1   25
2   30